Revit 2027 API
GenericZone.RemoveSpaces Method
 Removes spaces from the zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSpaces(
	ISet<ElementId> spaceIds
)
Public Sub RemoveSpaces (
	spaceIds As ISet(Of ElementId)
)
public:
void RemoveSpaces(
	ISet<ElementId^>^ spaceIds
)
member RemoveSpaces :
        spaceIds : ISet<ElementId> -> unit
Parameters
spaceIds ISet<ElementId>
 The spaces to be removed from the zone. The spaces that are not in the zone will be ignored.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This generic zone must be space-based.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace